{
  "title": "Análisis",
  "description": "Configura y ejecuta las fases del análisis",
  "phaseLabel": "Fase {{phase}}: {{name}}",
  "notAvailable": "No disponible",
  "cancelling": "Cancelando fase...",
  "configureTooltip": "Configurar fase",
  "actions": {
    "stopping": "Deteniendo...",
    "stop": "Detener",
    "reset": "Reiniciar",
    "runAll": "Ejecutar Todo"
  },
  "warnings": {
    "noLlmTitle": "Modo sin LLM activo",
    "noLlmDesc": "Las fases 6, 7 y 8 están deshabilitadas. Algunas visualizaciones de la fase 9 no se generarán. Puedes cambiar el modo en Configuración.",
    "ollamaOfflineTitle": "El motor de IA local no está en ejecución",
    "ollamaOfflineDesc": "Las fases 6, 7 y 8 requieren el motor de IA local para funcionar. Inicia el motor o cambia a modo Nube / Sin IA en Configuración.",
    "noModelsTitle": "No hay modelos de IA instalados",
    "noModelsDesc": "El motor de IA local está activo pero no tiene modelos descargados. Descarga un modelo desde Configuración para usar las fases 6, 7 y 8.",
    "modelMissingTitle": "Modelo de IA no encontrado",
    "modelMissingDesc": "El modelo seleccionado \"{{model}}\" no está instalado. Selecciona otro modelo o descárgalo desde Configuración.",
    "noDataset": "Carga un dataset en la sección \"Datos\" antes de ejecutar el análisis."
  },
  "totalTime": "Tiempo total del análisis",
  "completed": {
    "title": "¡Análisis completado!",
    "description": "Todas las fases se han ejecutado correctamente. Revisa los resultados y visualizaciones."
  },
  "toast": {
    "datasetRequiredTitle": "Dataset requerido",
    "datasetRequiredDesc": "Por favor, carga un dataset primero",
    "stoppedTitle": "Análisis detenido",
    "stoppedRolledBack": "Los cambios parciales han sido revertidos. El sistema está en su estado anterior.",
    "stoppedDesc": "El análisis ha sido detenido."
  },
  "phaseWarnings": {
    "phase6Slow": "Esta fase puede tardar bastante tiempo debido a la complejidad de analizar los temas de todas las reseñas con IA.",
    "phase7Slow": "Esta fase puede tardar bastante tiempo debido a la complejidad de resumir múltiples reseñas con IA.",
    "noLlmPhase9": "Sin LLM: las visualizaciones de temas y resúmenes no se generarán."
  },
  "disabledReason": {
    "noLlm": "Requiere un motor de IA. Configura uno en Configuración.",
    "ollamaOffline": "El motor de IA local no está en ejecución. Inícialo para usar la IA local.",
    "noModels": "No hay modelos de IA instalados. Descarga uno desde Configuración.",
    "modelMissing": "El modelo \"{{model}}\" no está instalado. Selecciona otro o descárgalo en Configuración."
  },
  "alreadyRunning": "Ya hay una fase en ejecución. Espera a que termine antes de iniciar otra."
}
